Услуги/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Услуги/src/AccumulationRegisters/ОстаткиМатериалов/ОстаткиМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМатериалов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Услуги/src/AccumulationRegisters/СтоимостьМатериалов/СтоимостьМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьМатериалов</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Материал</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Услуги/src/Documents/ПриходнаяНакладная/ObjectModule.bsl
//Процедура ОбработкаПроведения(Отказ,Режим)
//	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//	//Данный фрагмент построен конструктором.
//	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
//
//	// регистр ОстаткиМатериалов
//	Движения.ОстаткиМатериалов.Записывать = Истина;
//	Для Каждого ТекСтрокаМатериалы из Материалы Цикл
//		Движение = Движения.ОстаткиМатериалов.Добавить();
//		Движение.Период = Дата;
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Материал = ТекСтрокаМатериалы.Материал;
//		Движение.Склад = Склад;
//		Движение.Количество = ТекСтрокаМатериалы.Количество;
//	КонецЦикла;
//
//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)	
		Движения.ОстаткиМатериалов.Записывать = Истина;
		Движения.СтоимостьМатериалов.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл
			// Регистр ОстаткиМатериалов Приход
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаМатериалы.Материал;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаМатериалы.Количество;
			
			
			
			// Регистр Стоимость Материалов Приход
			Движение = Движения.СтоимостьМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаМатериалы.Материал;
			Движение.Стоимость = ТекСтрокаМатериалы.Сумма;
	КонецЦикла;
КонецПроцедуры
